; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
	       (handempty)
	       (holding ?x)
	       )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem blocks_words)
	(:domain blocks)
(:objects 

D R A W O E P C - block
)
(:init
(HANDEMPTY)
(CLEAR O)
(ONTABLE O)
(CLEAR R)
(ON R P)
(ONTABLE P)
(CLEAR E)
(ONTABLE E)
(CLEAR D)
(ON D A)
(ON A C)
(ONTABLE C)
(CLEAR W)
(ONTABLE W)
)
(:goal (and
(CLEAR W)(ONTABLE D)(ON W A)(ON A D)
))
)

; plan
1. (unstack d a)
   deleted: (clear d) (handempty) (on d a)
   added: (holding d) (clear a)
   goals met: 1 of 4
2. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 2 of 4
3. (unstack a c)
   deleted: (clear a) (handempty) (on a c)
   added: (holding a) (clear c)
   goals met: 2 of 4
4. (stack a d)
   deleted: (holding a) (clear d)
   added: (clear a) (handempty) (on a d)
   goals met: 3 of 4
5. (pick-up w)
   deleted: (ontable w) (clear w) (handempty)
   added: (holding w)
   goals met: 2 of 4
6. (stack w a)
   deleted: (holding w) (clear a)
   added: (clear w) (handempty) (on w a)
   goals met: 4 of 4
